opendj-sdk/opendj3-server-dev/tests/staf-tests/functional-tests/shared/data/dsml/suites/06delmoddelsuite/data/del137.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 1546
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
     <modifyRequest dn="uid=brentz, ou=people, o=dsmlfe.com">
          <modification name="seealso" operation="delete">
               <value>cn=Directory Manager, o=dsmlfe.com</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=dsmith, ou=people, o=dsmlfe.com">
          <modification name="seealso" operation="delete">
               <value>cn=Directory Manager, o=dsmlfe.com</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=scarte2, ou=people, o=dsmlfe.com">
          <modification name="seealso" operation="delete">
               <value>cn=Directory Manager, o=dsmlfe.com</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=dthorud, ou=people, o=dsmlfe.com">
          <modification name="seealso" operation="delete">
               <value>cn=Directory Manager, o=dsmlfe.com</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=ekohler, ou=people, o=dsmlfe.com">
          <modification name="seealso" operation="delete">
               <value>cn=Directory Manager, o=dsmlfe.com</value>
          </modification>
     </modifyRequest>
  </batchRequest>
  </soap-env:Body>
  </soap-env:Envelope>
